Static Public Member Functions | List of all members
ACAPI::MEP::v1::ModifiableElement Class Referencefinal
MEP Element Manager
The Modifiable Element represents an instantiable ModifiableElementBase. More...
#include <MEPModifiableElement.hpp>
 Inheritance diagram for ACAPI::MEP::v1::ModifiableElement:
 Static Public Member Functions
static Result< ModifiableElement >  | Get (const UniqueID &uniqueId)
Returns a Modifiable Element.
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Protected Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Modifier (ModifiableElementBase &)
 void  | FinalizeModification () override
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
Detailed Description
The Modifiable Element represents an instantiable ModifiableElementBase.
Since
Archicad 27
Member Function Documentation
◆ Get()
 static Result< ModifiableElement > ACAPI::MEP::v1::ModifiableElement::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Modifiable Element.
Parameters
uniqueId | The UniqueID of the requested Element.
Returns
If the uniqueId belongs to an Element, returns the object associated to it, otherwise Error.